InformationRegisters/ИсторияЗвонковАТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсторияЗвонковАТС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пропущен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Лид</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разговор</Name>
					<Comment>Длительность разговора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ожидание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АвтоматическиеДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЗаписиСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛинияНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_НомерТолькоЦифры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерФормат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принят</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДЗаписиЧислом</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправлениеЗвонка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВнутреннийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИДВАТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/НаправлениеЗвонка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>НаправлениеЗвонка</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыСозданияЛида.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыСозданияЛида</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вручную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоматическиПриВходящемЗвонке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоматическиПриРазбореИсторииАТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоматическиПриРазбореЭлектронныхЯщиков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоматическиПоДаннымРойстат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоматическиПоДаннымБитрикс24</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженИзExcel</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ИсторияЗвонковАТС/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	НаборКонстант = Константы.СоздатьНабор("АвтоматическиСоздаватьЛидыПоПропущеннымЗвонкам, 
									|АвтоматическиСоздаватьЛидыПоПропущеннымЗвонкамТолькоСРекламнымИсточником,
									|ДатаНачалаАвтоматическогоСозданияЛидовПоПропущеннымЗвонкам,
									|АвтоматическиСоздаватьЛидыПоПринятымЗвонкамОффлайн,
									|ДатаНачалаАвтоматическогоСозданияЛидовПоПринятымЗвонкамОффлайн");
	НаборКонстант.Прочитать();
		
	Если НаборКонстант.АвтоматическиСоздаватьЛидыПоПринятымЗвонкамОффлайн Тогда
		МассивВН = СофтФон.ВнутренниеНомераПринимающиеЗвонки();
	КонецЕсли;
	
	Для Каждого ТекЗапись Из ЭтотОбъект Цикл
		
		//ТекЗапись.НомерТолькоЦифры = СофтФон.ОставитьТолькоЦифры(ТекЗапись.Номер);
		ТекЗапись.НомерФормат = СофтФон.ПолучитьНомерТелефонаВМеждународномФорматеПользователя(ТекЗапись.Номер);
		
		Если НЕ ТекЗапись.Обработан И НЕ ЗначениеЗаполнено(ТекЗапись.Лид) И ЗначениеЗаполнено(ТекЗапись.ИД) Тогда
			СтруктураВозврата = ОбщийМодуль.ПолучитьЛидПоIDЗвонка(ТекЗапись.ИД);
			ТекЗапись.Лид = СтруктураВозврата.ЛидСсылка;
			Если ЗначениеЗаполнено(ТекЗапись.Лид) Тогда
				ТекЗапись.Обработан 	= Истина;
				ТекЗапись.Действие 		= ?(СтруктураВозврата.Новый, Справочники.АвтоматическиеДействия.СозданНовыйЛид, Справочники.АвтоматическиеДействия.ОбновленЛид);
				ТекЗапись.Пользователь  = ?(СтруктураВозврата.Новый, ТекЗапись.Лид.Автор, Справочники.Пользователи.ПустаяСсылка());
				ТекЗапись.ДатаОбработки = СтруктураВозврата.Дата;
			Иначе
				НомерВИсключениях = СофтФонВызовСервера.НомерТелефонаВИсключениях(ТекЗапись.Номер);
				//#4889
				Если НЕ НомерВИсключениях И НЕ ПустаяСтрока(ТекЗапись.ЛинияНомер) Тогда
					ЛинияНомерМФ = СофтФон.ПолучитьНомерТелефонаВМеждународномФорматеПользователя(ТекЗапись.ЛинияНомер);
					НомерВИсключениях = СофтФонВызовСервера.НомерТелефонаВИсключениях(ЛинияНомерМФ);
				КонецЕсли;
				
				ДанныеЗвонка = Новый Структура("ИДЗвонка, ИДСессииЗвонка, ИДВАТС, НомерКлиента, ВнешняяЛиния, Пропущен, НовыйЗвонок, ЗвонокОффлайн",
												ТекЗапись.ИД, "", ТекЗапись.ИДВАТС, ТекЗапись.НомерФормат, ТекЗапись.ЛинияНомер, ТекЗапись.Пропущен, Ложь, Ложь);
				
				Если ТекЗапись.Пропущен 
					И НаборКонстант.АвтоматическиСоздаватьЛидыПоПропущеннымЗвонкам
					И ТекЗапись.Дата >= НаборКонстант.ДатаНачалаАвтоматическогоСозданияЛидовПоПропущеннымЗвонкам
					И ТекЗапись.Направление = Перечисления.НаправлениеЗвонка.Входящий // №6325 необходимо создавать лиды только по входящим пропущенным звонкам
					И НЕ НомерВИсключениях
					Тогда
					
					// ищем Лид (без учета ИД)
					ДанныеЗвонка.ИДЗвонка = "";
					ЛидСсылка = ОбщийМодуль.ПолучитьЛидВРаботе(ДанныеЗвонка, Новый Структура, Ложь);
					// #15439 не заполнять автора
					//ПользовательЛида = СофтФон.НайтиПользователяПоВнутреннемуНомеру(ТекЗапись.ВнутреннийНомер);
					ПользовательЛида = Справочники.Пользователи.ПустаяСсылка();
					//++#6672
					РекламныйИсточник = Справочники.РекламныеИсточники.ПустаяСсылка();
					Если Не ПустаяСтрока(ТекЗапись.ЛинияНомер) Тогда
						РекламныйИсточник = Справочники.РекламныеИсточники.ПолучитьРекламныйИсточникПоНомеруТелефонаНаСервере(ТекЗапись.ЛинияНомер);
					КонецЕсли;
					//--#6672
					
					//++ №6369 если включено создание лидов по пропущенным только когда определен рекламный источник
					Если НаборКонстант.АвтоматическиСоздаватьЛидыПоПропущеннымЗвонкамТолькоСРекламнымИсточником И НЕ ЗначениеЗаполнено(РекламныйИсточник) Тогда
						Продолжить;
					КонецЕсли;
					//-- №6369
					
					РеквизитыЛида = Новый Структура("РекламныйИсточник, СпособСоздания, ДатаЗвонкаСоздавшегоЛид, ПользовательЛида", 
										   РекламныйИсточник, Перечисления.СпособыСозданияЛида.АвтоматическиПриРазбореИсторииАТС, ТекЗапись.Дата, ПользовательЛида); //#8090				
										   
					ДанныеЗвонка.ИДЗвонка = ТекЗапись.ИД;					   
					Если НЕ ЗначениеЗаполнено(ЛидСсылка) Тогда
						//++#6672
						ЛидСсылка = ОбщийМодуль.ПолучитьЛидВРаботе(ДанныеЗвонка, РеквизитыЛида, Истина);
						//--#6672
						ТекЗапись.Лид = ЛидСсылка;
						ТекЗапись.Обработан = Истина;
						ТекЗапись.Действие = Справочники.АвтоматическиеДействия.СозданНовыйЛид;
						ТекЗапись.ДатаОбработки = ТекущаяДатаСеанса();
						ТекЗапись.Пользователь  = ПользовательЛида;
						
						ОбщийМодуль.УстановитьНеобходимостьОбновленияАРМРозницы(); //Т.к. создался новый лид, нужно установить потребность обновления АРМ
					Иначе
						// вызовем ПолучитьЛидВРаботе для записи в историю лида и звонки лида
						//++#6672
						РеквизитыЛида.Вставить("Ссылка", ЛидСсылка);
						ЛидСсылка = ОбщийМодуль.ПолучитьЛидВРаботе(ДанныеЗвонка, РеквизитыЛида, Истина);
						//--#6672
						ТекЗапись.Лид = ЛидСсылка;
						ТекЗапись.Обработан = Истина;
						ТекЗапись.Действие = Справочники.АвтоматическиеДействия.ОбновленЛид;
						ТекЗапись.ДатаОбработки = ТекущаяДатаСеанса();
						ТекЗапись.Пользователь  = ПользовательЛида;
					КонецЕсли;
					
				// #16235 
				ИначеЕсли НЕ ТекЗапись.Пропущен
					И ТекЗапись.Направление = Перечисления.НаправлениеЗвонка.Входящий
					И ЗначениеЗаполнено(ТекЗапись.ВнутреннийНомер)
					И НаборКонстант.АвтоматическиСоздаватьЛидыПоПринятымЗвонкамОффлайн
					И ТекЗапись.Дата >= НаборКонстант.ДатаНачалаАвтоматическогоСозданияЛидовПоПринятымЗвонкамОффлайн					 
					И НЕ НомерВИсключениях
					
					Тогда
					Если НЕ МассивВН.Найти(ТекЗапись.ВнутреннийНомер) = Неопределено Тогда						
						
						ДанныеЗвонка.ЗвонокОффлайн = Истина;
						ДанныеЗвонка.ИДЗвонка = "";
						ЛидСсылка = ОбщийМодуль.ПолучитьЛидВРаботе(ДанныеЗвонка, Новый Структура, Ложь);					
						ПользовательЛида = Справочники.Пользователи.ПустаяСсылка();
						
						РекламныйИсточник = Справочники.РекламныеИсточники.ПустаяСсылка();
						Если Не ПустаяСтрока(ТекЗапись.ЛинияНомер) Тогда
							РекламныйИсточник = Справочники.РекламныеИсточники.ПолучитьРекламныйИсточникПоНомеруТелефонаНаСервере(ТекЗапись.ЛинияНомер);
						КонецЕсли;
										
						РеквизитыЛида = Новый Структура("РекламныйИсточник, СпособСоздания, ДатаЗвонкаСоздавшегоЛид, ПользовательЛида", 
										   РекламныйИсточник, Перечисления.СпособыСозданияЛида.АвтоматическиПриРазбореИсторииАТС, ТекЗапись.Дата, ПользовательЛида); //#8090				
					    ДанныеЗвонка.ИДЗвонка = ТекЗапись.ИД;
						
						Если НЕ ЗначениеЗаполнено(ЛидСсылка) Тогда
							ЛидСсылка = ОбщийМодуль.ПолучитьЛидВРаботе(ДанныеЗвонка, РеквизитыЛида, Истина);
						
							ТекЗапись.Лид = ЛидСсылка;
							ТекЗапись.Обработан = Истина;
							ТекЗапись.Действие = Справочники.АвтоматическиеДействия.СозданНовыйЛид;
							ТекЗапись.ДатаОбработки = ТекущаяДатаСеанса();
							ТекЗапись.Пользователь  = ПользовательЛида;
						
							ОбщийМодуль.УстановитьНеобходимостьОбновленияАРМРозницы(); //Т.к. создался новый лид, нужно установить потребность обновления АРМ
						Иначе
							// вызовем ПолучитьЛидВРаботе для записи в историю лида и звонки лида
							РеквизитыЛида.Вставить("Ссылка", ЛидСсылка);
							ЛидСсылка = ОбщийМодуль.ПолучитьЛидВРаботе(ДанныеЗвонка, РеквизитыЛида, Истина);
							//--#6672
							ТекЗапись.Лид = ЛидСсылка;
							ТекЗапись.Обработан = Истина;
							ТекЗапись.Действие = Справочники.АвтоматическиеДействия.ОбновленЛид;
							ТекЗапись.ДатаОбработки = ТекущаяДатаСеанса();
							ТекЗапись.Пользователь  = ПользовательЛида;						
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;			
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекЗапись.Лид) И НЕ ТекЗапись.Обработан Тогда
			ТекЗапись.Обработан 	= Истина;
			ТекЗапись.Пользователь  = ТекЗапись.Лид.Автор;
	    	ТекЗапись.ДатаОбработки = ТекущаяДатаСеанса();
		КонецЕсли;

	КонецЦикла;
КонецПроцедуры
